slime7/remapad/firmware/sdkconfig.defaults
# PocketJS ESP-IDF components require ESP-IDF >= 6.0 and < 6.2.
CONFIG_IDF_TARGET="esp32s3"

# Product hardware: ESP32-S3R8 (8MB embedded Octal PSRAM) with 16MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 8MB Octal PSRAM is used by the PocketJS guest and UI framebuffer.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_BOOT_INIT=y

# Match the official PocketJS ESP-IDF examples for the application task.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# The PocketJS UI runs an interpreted Vue Vapor bundle plus the software RGB565
# renderer on one core, so the SoC runs at its rated 240 MHz instead of the
# 160 MHz default.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Board touch panel is a CST816T; the espressif CST816S driver's chip ID read
# can break init on T-variant silicon.
CONFIG_ESP_LCD_TOUCH_CST816S_DISABLE_READ_ID=y

# Bluetooth LE controller peripheral (ADR 0010): NimBLE host, BLE-only,
# no SMP (NS2 pairing is a private protocol), host memory in PSRAM.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
